clc
clear all
L = 10^(0.5/10);        %系统损耗 
k = 1.38*10^(-23);      %玻尔兹曼常数
F = 10^(0.5/10);        %噪声系数
B = 0.5*10^6;           %频谱宽度
T = 290;                %系统温度
Gpbest=10^3*[ 0.3656         0         0         0
         0    0.5713         0         0
         0         0    0.1922         0
         0         0         0    1.8510];
Gabest=[10000           0           0           0
           0       10000           0           0
           0           0       10000           0
           0           0           0       10000];
G=[10000 0 0 0
   0 10000 0 0
   0 0 10000 0
   0 0 0 10000];
lamda = repmat(0.04,4,4);
sigma = [10 10 10 10
        10 10 10 10
        10 10 10 10
        10 10 10 10];
Tx=[-10,20,40,70];
Ty=[40,70,40,60];
% z=[20,20,20,20];
Rx=[10,20,25,40];
Ry=[0,20,5,0];
for i=1:4
    for j=1:4
    R(i,j)=((Tx(j)-Rx(i)).^2+(Ty(j)-Ry(i)).^2)^0.5;    
    end
end
SNR = (Gpbest.*Gabest.*lamda.^2.*sigma)./(4^3*pi^3*L*k*F*B*T.*R.^4.*10^12);   %信噪比
P=(SNR.*4^3*pi.^3*L*k*F*B*T.*R.^4.*10^12)./(G.*lamda.^2.*sigma);
for i=1:4
    for j=1:4
        if isnan(P(i,j))
            P(i,j)=0;
        end
    end
end
PTOTAL=sum(P,"all");
disp(PTOTAL)
pppp=sum(P,2);